###### 3) Read Excel

In [3]:
import pandas as pd
excel = pd.read_excel('D:\\Pandas\\CodeBasic\\datasets\\stock_data.xlsx', sheet_name = 'Sheet1')
excel # My excel file has been successfully imported into Pandas. (Might not need the sheet_name = part, just the actual sheet name.)

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

To convert the n.a. in the walmart/people column, you can use the converter, you must first define a function...

In [5]:
def convert_people_cell(cell):
    if cell=="n.a.":
        return 'Sam Walton'
    return cell

We now need to run the pd.read command again, with the converters argument supplied, and pandas will then look at every cell in the people column and, where we have an n.a. value, it will run the function and perform the conversion...

In [6]:
excel = pd.read_excel('D:\\Pandas\\CodeBasic\\datasets\\stock_data.xlsx', sheet_name = 'Sheet1', converters= {
        'people': convert_people_cell},)

In [7]:
excel # It actually ran successfully and we now have Sam Walton in the people column for Walmart

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65     Sam Walton
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

It strikes me that this needs more granularity as we could have more than just one n.a. value in the people column and they won't all be Sam Walton. Although this isn't a fantastic example, it does show how converters work and we are going to do another one...

In [8]:
def convert_eps_cell(cell):
    if cell=="not available":
        return None
    return cell

That seems to have completed successfully, so now we are going to re-run the read_excel command to see what has happened RIL/eps value...

In [9]:
excel = pd.read_excel('D:\\Pandas\\CodeBasic\\datasets\\stock_data.xlsx', sheet_name = 'Sheet1', converters= {
        'people': convert_people_cell,
        'eps':convert_eps_cell
})

In [10]:
excel # We see that the RIL/eps cell now has a value of NaN rather than 'not available'

  tickers    eps  revenue price         people
0   GOOGL  27.82       87   845     larry page
1     WMT   4.61      484    65     Sam Walton
2    MSFT  -1.00       85    64     bill gates
3    RIL     NaN       50  1023  mukesh ambani
4    TATA   5.60       -1  n.a.     ratan tata

We can use converters like this to cleanse messy data to be able to process that data much easier later on and get more meaningful results from any quries that we run against it

###### 4) Write df back to Excel file

In [12]:
# excel.to_excel('04stock_data.xlsx', sheet_name = 'RFH') - Getting the openpyxl error again :(

You can use all the same arguments here that we did when we were writing to CSV file eg header = False, index = False etc. startrow and startcol tells pandas what rows and columns to start writing as long as you provide them with a number. This has the effect of starting to write at, for example, row 2 column 2 instead of 0,0...not sure how useful that is.

###### Writing two df's to the same excel file in two sheets - ExcelWriter

Creating our dataframes for this example...

In [13]:
df_stocks = pd.DataFrame({
    'tickers': ['GOOGL', 'WMT', 'MSFT'],
    'price': [845, 65, 64 ],
    'pe': [30.37, 14.26, 30.97],
    'eps': [27.82, 4.61, 2.12]
})

df_weather =  pd.DataFrame({
    'day': ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature': [32,35,28],
    'event': ['Rain', 'Sunny', 'Snow']
})

Writing the df's to the same excel file but into two different sheets...

In [19]:
# with pd.ExcelWriter('stocks_weather.xlsx') as writer:
#    df_stocks.to_excel(writer, sheet_name="stocks")
#    df_weather.to_excel(writer, sheet_name="weather") - More openpyxl issues